## GreenDS
# Data Management and Storage
## Access to MySQL from Jupyter Notebook

## Introduction
This Jupyter Notebook is part of exercise *dms_ex_15_access_python*. The purpose of 
this Jupyter Notebook is to demonstrate how to connect to a MySQL database to 
retrieve data, using SQL queries. We will import data to a Pandas Dataframe, 
and make some analysis afterwards.

Let's begin.

**1. Install necessary modules**

The following module is necessary: *pymysql*.

In [1]:
import pymysql

Configure the connection:

In [2]:
conn = pymysql.connect(
    host="localhost",
    user="dms_user",
    password="22dms2022",
    database="dms_INE"
)

Create a cursor. The cursor is a middleware between python and the database that
enhances performance.

In [3]:
cur = conn.cursor()

Use the cursor to make a database query:

In [4]:
cur.execute("SELECT * FROM region;")

3436

Show the first row in the results:

In [5]:
result = cur.fetchone()
print(result)

('1', 'PT', 1, 'Continente')

Or we can retrieve all rows:

In [6]:
result = cur.fetchall()

We can add these results to a Pandas DataFrame, which is a convenient form of 
managing data in a notebook. We will add the names of the columns to the DataFrame:

In [7]:
import pandas as pd

In [8]:
df = pd.DataFrame(result)
df.columns = ['NutsID', 'ParentCodeID', 'level_ID', 'region_name']

Show the first rows of the dataframe:

In [9]:
df.head()

      NutsID ParentCodeID  level_ID        region_name
0         11            1         2              Norte
1        111           11         3         Alto Minho
2    1111601          111         4  Arcos de Valdevez
3  111160101      1111601         5   Aboim das Choças
4  111160102      1111601         5              Aguiã

We can do a more complex query, like one we did in exercise 14. First, define 
the query:

In [10]:
# SQL query
sql_query = '''SELECT 
    r3.region_name,
    r2.region_name ,
    r.region_name,
	e.`year` ,
	el.education_level,
	sum(e.value) AS sum_education
FROM
	education e
INNER JOIN education_level el ON
	e.education_level_ID = el.education_level_ID
INNER JOIN region r ON
	e.NutsID = r.NutsID
INNER JOIN region r2 ON
	r.ParentCodeID = r2.NutsID
INNER JOIN region r3 ON
	r2.ParentCodeID = r3.NutsID
WHERE
	el.education_level <> 'Total'
	AND r.level_ID = 5
	AND r3.region_name = 'Algarve'
	AND e.`year` = 2019
GROUP BY
	r.region_name, el.education_level;'''

And run the query, showing results:

In [11]:
cur.execute(sql_query)

268

Get all results and put them into a dataframe:

In [12]:
results = cur.fetchall()

df = pd.DataFrame(results)
df.head()

,0,1,2,3,4,5
0,Algarve,Albufeira,Albufeira e Olhos de Água,2019,Basic,200
1,Algarve,Albufeira,Albufeira e Olhos de Água,2019,None,26
2,Algarve,Albufeira,Albufeira e Olhos de Água,2019,Secondary / post-secondary,61
3,Algarve,Albufeira,Albufeira e Olhos de Água,2019,Superior,50
4,Algarve,Monchique,Alferce,2019,Basic,68

**Bigger queries**

If the query  is too long, it is easier to set the Jupyter in mode _magic_. 

This required the install of module ***ipyhton-sql***. It will allow to write iPython Magic commands in SQL. This will facilitate to run SQL queries, specially the longer ones that take more than one line.

In [ ]:
!pip install ipython-sql

We can loading that extension by adding `%%sql` to the beginning of the cell. If we do that, it indicates that the whole cell is SQL, then we can write SQL statements like if we were at DBeaver, MySQL command line or another mysql client. It can contain also multiple SQL statements, but only the result of the last one will be the output. This output was assigned to the local variable `result2` with the `<<` operator.

We need to load the extension:

In [13]:
%load_ext sql

To be able to use it, we need to set up the connection in a different way. Let's do this:

In [14]:
%sql mariadb+pymysql://dms_user:22dms2022@localhost:3306/dms_INE

We can do a simple query inline with the python code, putting results in a variable:

In [16]:
result = %sql SELECT * FROM region

 * mariadb+pymysql://dms_user:***@localhost:3306/dms_INE
3436 rows affected.

Or we can perform more complex queries, writing simple SQL and add results to
a variable. Notice that in this case, the notebook cell needs to start with `%%sql`.

In [15]:
%%sql

result2 << SELECT 
    r3.region_name,
    r2.region_name ,
    r.region_name,
	e.`year` ,
	el.education_level,
	sum(e.value) AS sum_education
FROM
	education e
INNER JOIN education_level el ON
	e.education_level_ID = el.education_level_ID
INNER JOIN region r ON
	e.NutsID = r.NutsID
INNER JOIN region r2 ON
	r.ParentCodeID = r2.NutsID
INNER JOIN region r3 ON
	r2.ParentCodeID = r3.NutsID
WHERE
	el.education_level <> 'Total'
	AND r.level_ID = 5
	AND r3.region_name = 'Algarve'
	AND e.`year` = 2019
GROUP BY
	r.region_name, el.education_level;

 * mariadb+pymysql://dms_user:***@localhost:3306/dms_INE
268 rows affected.
Returning data to local variable result2

Activate the ipython-sql extension in your notebook:

Add results to a dataframe:

In [17]:
pdf1 = result2.DataFrame()
pdf1

,region_name,region_name,region_name,year,education_level,sum_education
0,Algarve,Albufeira,Albufeira e Olhos de Água,2019,Basic,200
1,Algarve,Albufeira,Albufeira e Olhos de Água,2019,None,26
2,Algarve,Albufeira,Albufeira e Olhos de Água,2019,Secondary / post-secondary,61
3,Algarve,Albufeira,Albufeira e Olhos de Água,2019,Superior,50
4,Algarve,Monchique,Alferce,2019,Basic,68
...,...,...,...,...,...,...
263,Algarve,Vila Real de Santo António,Vila Nova de Cacela,2019,Superior,52
264,Algarve,Vila Real de Santo António,Vila Real de Santo António,2019,Basic,19
265,Algarve,Vila Real de Santo António,Vila Real de Santo António,2019,None,1
266,Algarve,Vila Real de Santo António,Vila Real de Santo António,2019,Secondary / post-secondary,3
267,Algarve,Vila Real de Santo António,Vila Real de Santo António,2019,Superior,2

List the tables in the database.

In [18]:
%sql show tables;

 * mariadb+pymysql://dms_user:***@localhost:3306/dms_INE
14 rows affected.

[('education',),
 ('education_level',),
 ('grassland',),
 ('labour',),
 ('livestock',),
 ('livestock_name',),
 ('permanent_crop',),
 ('permanent_crop_name',),
 ('production',),
 ('region',),
 ('region_level',),
 ('temporary_crop',),
 ('temporary_crop_name',),
 ('type_labour',)]

Q.1. _Obtain the number of total annual working unit (AWU) for municipalities that have the area of vineyeards higher than 10 ha, for year 2019. List the municipality name, year, area._

In [ ]:
%%sql 

/* write your code here */

## Create a graph of the Agricultural Census 2019 dashboard
In the beginning of the couse we defined our goal to create a database using the data made available by INE for the Agricultural Census 2019, that would allow to reproduce the charts included in the [AC dashboard](https://www.ine.pt/scripts/db_ra_2019.html).

While this is not fully possible for all charts, because some of the tables still need to be dowsloaded, preprocessed and imported to the database (like the data about the [Utilised Agriculture Area](https://www.ine.pt/xportal/xmain?xpid=INE&xpgid=ine_indicadores&indOcorrCod=0010518&contexto=bd&selTab=tab2&xlang=en), we can create charts for the **Permanent Crops** and **Temporary Crops**.

We will start by the permanent crops. We need to make a query to obtain the number of holdings with permanent crop per type of crop at the NUTS2 level for year 2019.

In [ ]:
%%sql 

perm_crop_result << SELECT
	pcn.crop_name ,
	SUM(pc.`hold`) AS sum_holdings
FROM
	permanent_crop pc
INNER JOIN permanent_crop_name pcn
ON
	pc.pc_name_ID = pcn.pc_name_ID
INNER JOIN region r ON
	pc.NutsID = r.NutsID
WHERE
	pc.`year` = 2019
	AND 
r.level_ID = 2
	AND pcn.crop_name <> 'Total'
GROUP BY
	pcn.pc_name_ID
ORDER BY
	sum_holdings DESC ;

Before we plot, let's import the result to a Pandas dataframe.

In [ ]:
perm_crop_df = perm_crop_result.DataFrame()

It is useful to check the structure of the dataframe created.

In [ ]:
perm_crop_df.info()

We can see that the values of the number of holdings is an object. But to be plotted, it should be of type integer. We can do the change with the following:

In [ ]:
perm_crop_df['sum_holdings'] = perm_crop_df['sum_holdings'].astype(str).astype(int)

And we can set the crop name to be the index of the dataframe:

In [ ]:
perm_crop_df = perm_crop_df.set_index(perm_crop_df['crop_name'])

We can, finally, make the barplot:

In [ ]:
perm_crop_df.plot(kind='bar')

## Do the chart for temporary crops
Repeat the query and chart creation, but for temporary crops.

In [ ]:
## write your code here